cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Binaries
brew 'apple-gcc42'
brew 'autoconf'
brew 'ghostscript'
brew 'git'
brew 'libtool'
brew 'mas'
brew 'imagemagick'
brew 'node'
brew 'openssl'
brew 'postgresql', restart_service: true
brew 'ruby-build'
brew 'rbenv'
brew 'redis'
brew 'wget'

# Apps
cask 'alfred'
cask 'anvil'
cask 'appzapper'
cask 'dropbox'
cask 'firefox'
cask 'gitbox'
cask 'google-chrome'
cask 'hipchat'
cask 'imageoptim'
cask 'postico'
cask 'postman'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'querious'
cask 'sketch'
cask 'sublime-text2'
cask 'transmit'
cask 'skype'

# Fonts
cask 'font-fontawesome'
cask 'font-karla'
cask 'font-lato'
cask 'font-lora'
cask 'font-montserrat'
cask 'font-open-sans'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'

# Mac App Store apps
mas '1Password', id: 443987910
mas 'Bear', id: 1091189122
mas 'Caffeine', id: 411246225
mas 'GIPHY CAPTURE', id: 668208984
mas 'iMovie', id: 408981434
mas 'Keynote', id: 409183694
mas 'LittleIpsum', id: 405772121
mas 'Numbers', id: 409203825
mas 'Pages', id: 409201541
mas 'Slack', id: 803453959
mas 'Tweetbot', id: 557168941
